Reports/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>КурсыВалют</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/КурсыВалют/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработатьВыборПериода(Результат, ДатаНачала, ДатаОкончания)
    Если Результат <> КодВозвратаДиалога.ОК Тогда
        Возврат; // пользователь нажал Отмена
    КонецЕсли;

    Отчет.ДатаНач.Значение = ДатаНачала;
    Отчет.ДатаКон.Значение = ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Заполним период отчета (по умолчанию НачалоГода - Текущая дата)
	Отчет.ДатаНач = НачалоГода(ТекущаяДата()); 
	Отчет.ДатаКон = ТекущаяДата();

	ЗаполнитьВалютуНаСервере();

	УстановитьЗаголовокДиаграммы();
	ОчиститьСообщения();

	СформироватьОтчетНаСервере(Отчет.ДатаНач,Отчет.ДатаКон,Валюта);
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры 



&НаКлиенте
Процедура ВыборПериода(Команда)
	// Процедура выбора периода (Начало, Конец) // Воссоздал механику типовой конфигурации по выбору периода
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("НачалоПериода", Отчет.ДатаНач);
	ПараметрыВыбора.Вставить("КонецПериода", Отчет.ДатаКон);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", ПараметрыВыбора, Элементы.ВыборПериода, , , , ОписаниеОповещения);

КонецПроцедуры   

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	// После выбора периода формируем отчет
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Отчет, РезультатВыбора, "ДатаНач,ДатаКон");
    СформироватьОтчет(Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура СформироватьОтчет(Команда)
	//Формируем заголовок
	УстановитьЗаголовокДиаграммы();
	
	//Заполняем данными диаграмму и Табличную часть, для Печати
	СформироватьОтчетНаСервере(Отчет.ДатаНач,Отчет.ДатаКон,Валюта);
	ТекстСообщения = "Вы запросили данные отчета с " + Формат(Отчет.ДатаНач, "ДФ=dd.MM.yyyy")
				+ " по " + Формат(Отчет.ДатаКон, "ДФ=dd.MM.yyyy") + Символы.ПС;

	Если МинДата > МаксДата Тогда
		ТекстСообщения = ТекстСообщения +"При том, что в систему не загружены данные за указанный период";
	Иначе
		ТекстСообщения = ТекстСообщения + "При том, что в систему загружены данные только с "
										+ Формат(МинДата, "ДФ=dd.MM.yyyy")+" по "
										+ Формат(МаксДата, "ДФ=dd.MM.yyyy");
    КонецЕсли;
	
	Если НачалоДня(МинДата)<>НачалоДня(Отчет.ДатаНач) или НачалоДня(МаксДата)<>НачалоДня(Отчет.ДатаКон) Тогда
			ПоказатьОповещениеПользователя(
            "Внимание! Период отчета отличается...",
            ,
            ТекстСообщения,
            БиблиотекаКартинок.Внимание,
            СтатусОповещенияПользователя.Важное 
			);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокДиаграммы()
    Элементы.ДиаграммаГрафик.Заголовок = 
        "Курсы валют(ы): " + Строка(Валюта) 
        + " с " + Формат(Отчет.ДатаНач, "ДФ=dd.MM.yyyy") 
        + " по " + Формат(Отчет.ДатаКон, "ДФ=dd.MM.yyyy");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВалютуНаСервере()
	Валюта.Добавить(Константы.ОргОсновнаяВалюта.Получить());
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере(ДатаНачала,ДатаОкончания,Валюта)
	// Для формирования диаграммы используем список значений для валюты 
	// учитываем множественный выбор валют, либо пустое поле для формирования
	// отчета по всем валютам, по умолчанию берется ОсновнаяВалюта из Констант
	
	
	ДиаграммаГрафик.Очистить();
	Отчет.ТабличнаяЧасть.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалют.Период КАК Период,
		|	КурсыВалют.Валюта КАК Валюта,
		|	КурсыВалют.Курс КАК Курс,
		|	КурсыВалют.Кратность КАК Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Период МЕЖДУ &ДатаНач И &ДатаКон";
	
	Если Валюта.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + 
		" И КурсыВалют.Валюта В (&Валюта)";
		Запрос.УстановитьПараметр("Валюта", Валюта.ВыгрузитьЗначения());
	КонецЕсли;
	Запрос.Текст = Запрос.Текст +" УПОРЯДОЧИТЬ ПО
   		|	Период";
	
	Запрос.УстановитьПараметр("ДатаКон", Отчет.ДатаКон);
	Запрос.УстановитьПараметр("ДатаНач", Отчет.ДатаНач);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МаксЗнач = 0;
	МинЗнач = 0;
	
	МинДата = КонецГода(ТекущаяДата());
	МаксДата = ТекущаяДата();
	
	//Используем запрос и ТЧ, в интересах печати, чтобы данные в реальном времени не разошлись
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Кратность > 1 Тогда
			СтрКратность = " за "+ВыборкаДетальныеЗаписи.Кратность;
		Иначе
			СтрКратность = "";
		КонецЕсли;

        ВыбДата = ВыборкаДетальныеЗаписи.Период;

		// Заполняем табличную часть
		ТЧ = Отчет.ТабличнаяЧасть.Добавить();
		ТЧ.Период = ВыбДата;
		ТЧ.Валюта = ВыборкаДетальныеЗаписи.Валюта;
		ТЧ.Курс = ВыборкаДетальныеЗаписи.Курс;
		ТЧ.Кратность = ВыборкаДетальныеЗаписи.Кратность;
		
		// Заполняе диаграмму отчета
		Серия = ДиаграммаГрафик.УстановитьСерию(Строка(ВыборкаДетальныеЗаписи.Валюта)+СтрКратность);
		Точка = ДиаграммаГрафик.УстановитьТочку(ВыбДата);
		Точка.Текст = Формат(ВыбДата,"ДФ=dd.MM.yy");
		ДиаграммаГрафик.УстановитьЗначение(Точка,Серия,ВыборкаДетальныеЗаписи.Курс);
		
		Если ВыбДата < МинДата Тогда
			МинДата = ВыбДата;
			МаксДата = ВыбДата;
		КонецЕсли;

		Если ВыбДата > МаксДата Тогда
			МаксДата = ВыбДата;
		КонецЕсли;

		
		Если ВыборкаДетальныеЗаписи.Курс > МаксЗнач Тогда
			МаксЗнач = ВыборкаДетальныеЗаписи.Курс;
		КонецЕсли;
		Если (ВыборкаДетальныеЗаписи.Курс < МинЗнач) или (МинЗнач = 0) Тогда
			МинЗнач = ВыборкаДетальныеЗаписи.Курс;
		КонецЕсли;
		 
	КонецЦикла;

	Если МинЗнач > 2 Тогда
		МинЗнач = МинЗнач - 2;
	КонецЕсли;

	
	ДиаграммаГрафик.ОсьЗначений.МинимальноеЗначение	= МинЗнач;
	ДиаграммаГрафик.ОсьЗначений.МаксимальноеЗначение = МаксЗнач+2;

			
КонецПроцедуры


&НаКлиенте
Процедура Печать(Команда)
	ТабДок = ПечатьНаСервере(Отчет.ДатаНач,Отчет.ДатаКон,Валюта);
	ТабДок.Показать("Отчёт. Курсы валют(ы)");
КонецПроцедуры 

&НаСервере
Функция ПечатьНаСервере(ДатаНачала,ДатаОкончания,Валюта)

	// Берём пустую диаграмму из макета       
	Макет = Отчеты.КурсыВалют.ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Диаграмма");
	ДиаграммаМакета = ОбластьМакета.Рисунки["D1"].Объект;

	ДиаграммаМакета.Очистить();

	//Заполняем данные из Табличной части отчета
	
	
	МаксЗнач = 0;
	МинЗнач = 0;
	
	МинДата = ТекущаяДата();
	МаксДата = ТекущаяДата();
	
	Для Каждого СтрокаТЧ Из Отчет.ТабличнаяЧасть Цикл 
	
	
		Если СтрокаТЧ.Кратность > 1 Тогда
			СтрКратность = " за "+СтрокаТЧ.Кратность;
		Иначе
			СтрКратность = "";
		КонецЕсли;

		// Установка серии с именем
		ИмяСерии = Строка(СтрокаТЧ.Валюта) + СтрКратность;
		
		Серия = Неопределено;
		Для Каждого ТекСерия Из ДиаграммаМакета.Серии Цикл
			Если ТекСерия.Значение = ИмяСерии Тогда
				Серия = ТекСерия;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Серия = Неопределено Тогда
			// Создаем новую серию с заданным именем
			Серия = ДиаграммаМакета.Серии.Добавить();
			Серия.Значение = ИмяСерии;
			Серия.Текст = ИмяСерии;
			Серия.Маркер = ТипМаркераДиаграммы.Нет; 
			Серия.ФорматЗначенийВПодписях = "ЧДЦ=2";
		КонецЕсли;
		
		
		
		ВыбДата = СтрокаТЧ.Период;
		Точка = ДиаграммаМакета.УстановитьТочку(ВыбДата);
		Точка.Текст = Формат(ВыбДата,"ДФ=dd.MM.yy");
		ДиаграммаМакета.УстановитьЗначение(Точка,Серия,СтрокаТЧ.Курс);
		
		Если ВыбДата < МинДата Тогда
			МинДата = ВыбДата;
			МаксДата = ВыбДата;
		КонецЕсли;

		Если ВыбДата > МаксДата Тогда
			МаксДата = ВыбДата;
		КонецЕсли;

		
		Если СтрокаТЧ.Курс > МаксЗнач Тогда
			МаксЗнач = СтрокаТЧ.Курс;
		КонецЕсли;
		Если (СтрокаТЧ.Курс < МинЗнач) или (МинЗнач = 0) Тогда
			МинЗнач = СтрокаТЧ.Курс;
		КонецЕсли;
		 
	КонецЦикла;
	
	МаксЗнач = МаксЗнач * 1.05;
	Если МинЗнач > 2 Тогда
		МинЗнач = МинЗнач - 2;
	КонецЕсли;

	ДиаграммаМакета.ОсьЗначений.МинимальноеЗначение	= МинЗнач;
	ДиаграммаМакета.ОсьЗначений.МаксимальноеЗначение = МаксЗнач+2;

	ДиаграммаМакета.ОбластьЗаголовка.Текст = "Курсы валют(ы): " + Строка(Валюта) 
		+ " с " + Формат(ДатаНачала, "ДФ=dd.MM.yyyy") 
		+ " по " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
	
    

	// Выводим в табличный документ
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.Вывести(ОбластьМакета);

	Возврат ТабДок;
КонецФункции
